In [34]:
import pandas as pd
import numpy as np

In [35]:
data = pd.read_excel("../data/normalization_data.xls", header=None)

In [36]:
data

     0    1    2     3
0   78  521  602  2863
1  144 -600 -521  2245
2   95 -457  468 -1283
3   69  596  695  1054
4  190  527  691  2051
5  101  403  470  2487
6  146  413  435  2571

In [37]:
data - data.min()/(data.max() - data.min())

            0           1           2            3
0   77.429752  521.501672  602.428454  2863.309455
1  143.429752 -599.498328 -520.571546  2245.309455
2   94.429752 -456.498328  468.428454 -1282.690545
3   68.429752  596.501672  695.428454  1054.309455
4  189.429752  527.501672  691.428454  2051.309455
5  100.429752  403.501672  470.428454  2487.309455
6  145.429752  413.501672  435.428454  2571.309455

In [38]:
data.max()

0     190
1     596
2     695
3    2863
dtype: int64

In [39]:
data.min()

0      69
1    -600
2    -521
3   -1283
dtype: int64

In [40]:
data - data.mean()/data.std()

            0           1           2            3
0   75.309998  520.602444  601.039834  2861.811846
1  141.309998 -600.397556 -521.960166  2243.811846
2   92.309998 -457.397556  467.039834 -1284.188154
3   66.309998  595.602444  694.039834  1052.811846
4  187.309998  526.602444  690.039834  2049.811846
5   98.309998  402.602444  469.039834  2485.811846
6  143.309998  412.602444  434.039834  2569.811846

In [41]:
data.abs().max()

0     190
1     600
2     695
3    2863
dtype: int64

In [42]:
10 ** np.ceil(np.log10(data.abs().max()))

0     1000.0
1     1000.0
2     1000.0
3    10000.0
dtype: float64

In [45]:
data / 10 ** np.ceil(np.log10(data.abs().max()))

       0      1      2       3
0  0.078  0.521  0.602  0.2863
1  0.144 -0.600 -0.521  0.2245
2  0.095 -0.457  0.468 -0.1283
3  0.069  0.596  0.695  0.1054
4  0.190  0.527  0.691  0.2051
5  0.101  0.403  0.470  0.2487
6  0.146  0.413  0.435  0.2571

In [15]:
data.mean()

0     117.571429
1     200.428571
2     405.714286
3    1712.571429
dtype: float64

In [16]:
data.describe()

                0           1           2            3
count    7.000000    7.000000    7.000000     7.000000
mean   117.571429  200.428571  405.714286  1712.571429
std     43.706815  504.151385  422.546137  1441.371090
min     69.000000 -600.000000 -521.000000 -1283.000000
25%     86.500000  -27.000000  451.500000  1552.500000
50%    101.000000  413.000000  470.000000  2245.000000
75%    145.000000  524.000000  646.500000  2529.000000
max    190.000000  596.000000  695.000000  2863.000000